library(futile.logger)


d <- 1000 # количество датчиков
s <- 10 # количество сенсоров на датчик
n_per_h <- 4 # количество измерений в час
unit_size <- 16 # объем одной метрики в байтах
overhead <- 4# накладные расходы на хранение

v_per_day <- d * s * (24*n_per_h) * unit_size * overhead
print(paste0("ќбъем данных в сутки: ", round(v_per_day/1024, 0), " кбайт | ", round(v_per_day/1024/1024, 0), " ћбайт"))
print(paste0("ќбъем данных в мес€ц: ", round(v_per_day*30/1024/1024, 0), " ћбайт | ", round(v_per_day*30/1024/1024/1024, 1), " √байт"))
print(paste0("ќбъем данных в год: ", round(v_per_day*365/1024/1024, 0), " ћбайт | ", round(v_per_day*365/1024/1024/1024, 1), " √байт"))
